<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-dev]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-dev]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-dev]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-dev]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-dev]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635588900000003]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-dev-20231115195101112400000001]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-dev-20231113184635539100000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635579200000002]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-dev]
module.api_app.aws_api_gateway_deployment.dev: Refreshing state... [id=ujfnb3]
module.api_app.aws_api_gateway_stage.dev: Refreshing state... [id=ags-jfrfryrkn3-dev]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=undac0]
module.api_app.aws_api_gateway_method.daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-undac0-GET]
module.api_app.aws_api_gateway_integration.daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-undac0-GET]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_api_key.this will be created
  + resource "aws_api_gateway_api_key" "this" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "API Key for general access to coffee run api"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "coffeerun-general"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.api_app.aws_api_gateway_deployment.dev will be destroyed
  # (because aws_api_gateway_deployment.dev is not in configuration)
  - resource "aws_api_gateway_deployment" "dev" {
      - created_date  = "2023-10-20T23:14:24Z" -> null
      - execution_arn = "arn:aws:execute-api:eu-south-2:057149530255:jfrfryrkn3/" -> null
      - id            = "ujfnb3" -> null
      - invoke_url    = "https://jfrfryrkn3.execute-api.eu-south-2.amazonaws.com/" -> null
      - rest_api_id   = "jfrfryrkn3" -> null
      - triggers      = {
          - "redeployment" = "2be88ca4242c76e8253ac62474851065032d6833"
        } -> null
    }

  # module.api_app.aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "jfrfryrkn3"
      + triggers      = {
          + "redeployment" = "2be88ca4242c76e8253ac62474851065032d6833"
        }
    }

  # module.api_app.aws_api_gateway_method.daily_coffee will be updated in-place
  ~ resource "aws_api_gateway_method" "daily_coffee" {
      ~ api_key_required     = true -> false
        id                   = "agm-jfrfryrkn3-undac0-GET"
        # (7 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_stage.dev will be destroyed
  # (because aws_api_gateway_stage.dev is not in configuration)
  - resource "aws_api_gateway_stage" "dev" {
      - arn                   = "arn:aws:apigateway:eu-south-2::/restapis/jfrfryrkn3/stages/dev" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "uxzcts" -> null
      - execution_arn         = "arn:aws:execute-api:eu-south-2:057149530255:jfrfryrkn3/dev" -> null
      - id                    = "ags-jfrfryrkn3-dev" -> null
      - invoke_url            = "https://jfrfryrkn3.execute-api.eu-south-2.amazonaws.com/dev" -> null
      - rest_api_id           = "jfrfryrkn3" -> null
      - stage_name            = "dev" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null
    }

  # module.api_app.aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "jfrfryrkn3"
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.api_app.aws_api_gateway_usage_plan.this will be created
  + resource "aws_api_gateway_usage_plan" "this" {
      + arn         = (known after apply)
      + description = "Usage plan for coffee run api"
      + id          = (known after apply)
      + name        = "coffeerun-general"
      + tags_all    = (known after apply)

      + api_stages {
          + api_id = "jfrfryrkn3"
          + stage  = "dev"
        }
    }

  # module.api_app.aws_api_gateway_usage_plan_key.this will be created
  + resource "aws_api_gateway_usage_plan_key" "this" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.lambda_functions.aws_lambda_function.daily_coffee will be updated in-place
  ~ resource "aws_lambda_function" "daily_coffee" {
        id                             = "daily_coffee-dev"
      ~ last_modified                  = "2023-12-03T17:03:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "AIziRzz9KukWFwkxksLJRUTmG+Yv/3oVCXxfGztWvyQ=" -> "tmJHTThzzoS1I8SVJ3yr0AxyiK9gBLmkIwre3IVnx0k="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`